Revit 2026 API

# StickSymbolLocation Enumeration

---

Indicates the stick symbol location on the UI, which is used for the BuiltInParameter STRUCTURAL_STICK_SYMBOL_LOCATION.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum StickSymbolLocation
```
```vb
Public Enumeration StickSymbolLocation
```
```cpp
public enum class StickSymbolLocation
```
```fsharp
type StickSymbolLocation
```

| Member name | Value | Description |
| --- | --- | --- |
| StickViewBottom | 2 |  |
| StickViewCenter | 0 |  |
| StickViewLocLine | 3 |  |
| StickViewTop | 1 |  |

#### Reference

Autodesk.Revit.DB Namespace